{"add": [{"section": "Cart Service / Cart APIs", "requirement_reference": "story_summary.json: api_contracts_required", "description": "Missing explicit API endpoint for 'DELETE /api/v1/cart/items/{itemId}' to remove item from cart. LLD only describes remove_from_cart method but does not specify RESTful endpoint or contract.", "reason": "Story acceptance criteria requires RESTful endpoint for item removal, but LLD omits endpoint details and contract."}, {"section": "Cart Service / Cart APIs", "requirement_reference": "story_summary.json: business_logic_rules", "description": "Missing UI redirection logic for empty cart state ('continue shopping' link). LLD does not mention frontend behavior for empty cart.", "reason": "Story specifies empty cart must trigger UI redirection, but LLD lacks this business logic."}, {"section": "Cart Service / Cart APIs", "requirement_reference": "story_summary.json: api_contracts_required", "description": "Missing explicit API endpoint for 'DELETE /api/v1/cart' to clear cart. LLD does not specify this endpoint.", "reason": "Story requires clear cart functionality via RESTful endpoint, but LLD omits endpoint and contract."}], "modify": [{"section": "Cart Service / Cart APIs", "current_state": "POST /api/v1/cart/add endpoint accepts product_id, quantity, price. Validation rules allow quantity 1-99, price must match product price.", "required_change": "Update endpoint to POST /api/v1/cart/items for alignment with story API contract. Ensure default quantity is 1 if not specified. Add validation for unique cart item per product.", "reason": "Story specifies POST /api/v1/cart/items as contract and default quantity behavior. LLD uses different endpoint and lacks default quantity logic."}, {"section": "Cart Service / Cart APIs", "current_state": "PUT /api/v1/cart/update endpoint updates cart_item_id and quantity. Validation rules allow quantity 1-99, removes item if quantity is 0.", "required_change": "Update endpoint to PUT /api/v1/cart/items/{itemId} for alignment with story API contract. Ensure validation for cart item existence and product stock.", "reason": "Story specifies PUT /api/v1/cart/items/{itemId} as contract. LLD uses different endpoint and lacks explicit validation for cart item existence."}, {"section": "Cart Service / Cart APIs", "current_state": "GET /api/v1/cart endpoint returns cart items, subtotal, tax, total, item_count.", "required_change": "Add individual item subtotals and ensure cart total recalculation on any quantity mutation as per story business logic.", "reason": "Story requires automatic recalculation and item subtotals; LLD does not explicitly mention recalculation logic."}], "delete": null}