{"add": [{"category": "API Endpoint", "item": "POST /api/v1/cart/items", "description": "Add product to cart with default quantity of 1. This specific endpoint path and default quantity behavior must be explicitly documented in the LLD API specifications section.", "location": "Section 5: API Specifications - Shopping Cart APIs", "rationale": "Story SCRUM-1140 requires this exact API contract with default quantity behavior. LLD must specify the endpoint path, request/response schemas, and default quantity logic."}, {"category": "API Endpoint", "item": "GET /api/v1/cart", "description": "Retrieve cart items with individual subtotals and cart total. Must return itemized breakdown with per-item subtotals and overall cart total.", "location": "Section 5: API Specifications - Shopping Cart APIs", "rationale": "Story requires specific response structure including individual subtotals and cart total calculation. LLD must document the complete response schema."}, {"category": "API Endpoint", "item": "PUT /api/v1/cart/items/{itemId}", "description": "Update quantity of specific cart item. Must support quantity modification with automatic recalculation.", "location": "Section 5: API Specifications - Shopping Cart APIs", "rationale": "Story specifies this exact endpoint for quantity updates. LLD must document path parameters, request body, and recalculation trigger."}, {"category": "API Endpoint", "item": "DELETE /api/v1/cart/items/{itemId}", "description": "Remove specific item from cart. Must handle item removal and trigger total recalculation.", "location": "Section 5: API Specifications - Shopping Cart APIs", "rationale": "Story requires this specific endpoint for item removal. LLD must document the deletion logic and side effects."}, {"category": "Data Model Field", "item": "CartItem.priceSnapshot", "description": "Current price snapshot field in CartItem entity to capture product price at time of addition to cart. This ensures price consistency even if product price changes later.", "location": "Section 4: Database Design - CartItem Schema", "rationale": "Story explicitly requires 'current Price Snapshot' in CartItem entity. This is critical for maintaining price integrity during checkout process."}, {"category": "Business Logic Rule", "item": "Automatic Subtotal and Total Recalculation", "description": "Implement automatic recalculation of item subtotals and cart total upon any quantity mutation (add, update, remove operations). This must be triggered synchronously with cart modifications.", "location": "Section 3.3: Shopping Cart Module - Business Logic", "rationale": "Story mandates 'Automatic recalculation of subtotal and total upon any quantity mutation.' LLD must specify the calculation algorithm and trigger points."}, {"category": "Business Logic Rule", "item": "Empty Cart State Handling with UI Redirection", "description": "When cart is empty, system must trigger specific UI state that displays 'continue shopping' link/redirection. This logic must be documented in both backend response and frontend handling.", "location": "Section 3.3: Shopping Cart Module - Business Logic", "rationale": "Story requires 'Empty cart state must trigger specific UI redirection (continue shopping link).' LLD must specify the empty state detection and response structure."}, {"category": "Presentation Layer Component", "item": "Cart View Interface", "description": "Detailed specification of Cart View Interface component including layout, data binding, and interaction patterns for displaying cart items, quantities, subtotals, and total.", "location": "Section 3.3: Shopping Cart Module - Frontend Components", "rationale": "Story identifies 'Cart View Interface' as required presentation layer component. LLD must document component structure and responsibilities."}, {"category": "Presentation Layer Component", "item": "Empty Cart View with Redirection Link", "description": "Specification of Empty Cart View component that displays when cart has no items, including the 'continue shopping' redirection link and its behavior.", "location": "Section 3.3: Shopping Cart Module - Frontend Components", "rationale": "Story explicitly requires 'Empty Cart View with Redirection Link' as presentation layer component. LLD must document this specific UI state."}, {"category": "Presentation Layer Component", "item": "Add to Cart Interaction Handler", "description": "Detailed specification of the interaction handler that manages add-to-cart user actions, including API calls, loading states, error handling, and success feedback.", "location": "Section 3.3: Shopping Cart Module - Frontend Components", "rationale": "Story requires 'Add to Cart Interaction Handler' component. LLD must document event handling, API integration, and user feedback mechanisms."}, {"category": "Presentation Layer Component", "item": "Quantity Updater Component", "description": "Specification of Quantity Updater Component including UI controls (increment/decrement buttons or input field), validation rules, and real-time update behavior.", "location": "Section 3.3: Shopping Cart Module - Frontend Components", "rationale": "Story identifies 'Quantity Updater Component' as required presentation layer component. LLD must document component interface and update logic."}, {"category": "Data Model", "item": "ShoppingCart Entity Session/User Binding", "description": "Explicit documentation of how ShoppingCart entity is bound to user session or user ID, including session management strategy and persistence rules.", "location": "Section 4: Database Design - ShoppingCart Schema", "rationale": "Story specifies 'ShoppingCart (Entity bound to user session or ID)'. LLD must clarify the binding mechanism and lifecycle management."}], "modify": null, "delete": null}