{"add":[{"section":"API Specifications","requirement_reference":"POST /api/v1/cart/items (Story: Shopping Cart Management)","description":"Add API endpoint specification for adding products to cart with default quantity of 1.","reason":"Story requires this endpoint for cart functionality, but it is missing in the LLD."},{"section":"API Specifications","requirement_reference":"GET /api/v1/cart (Story: Shopping Cart Management)","description":"Add API endpoint specification for retrieving cart contents, individual subtotals, and cart total.","reason":"Story requires this endpoint for cart view, but it is missing in the LLD."},{"section":"API Specifications","requirement_reference":"PUT /api/v1/cart/items/{itemId} (Story: Shopping Cart Management)","description":"Add API endpoint specification for updating item quantity in cart.","reason":"Story requires this endpoint for quantity updates, but it is missing in the LLD."},{"section":"API Specifications","requirement_reference":"DELETE /api/v1/cart/items/{itemId} (Story: Shopping Cart Management)","description":"Add API endpoint specification for removing items from cart.","reason":"Story requires this endpoint for item removal, but it is missing in the LLD."},{"section":"Database Design","requirement_reference":"ShoppingCart and CartItem entities (Story: Shopping Cart Management)","description":"Add explicit entity definitions for ShoppingCart (bound to user session or ID) and CartItem (product reference, quantity, price snapshot).","reason":"Story specifies these data models, but LLD lacks explicit definitions with required attributes."}],"modify":[{"section":"Business Logic / Cart Service","current_state":"Subtotal and total calculation logic exists but lacks explicit automatic recalculation trigger on quantity mutation.","required_change":"Document automatic recalculation of subtotal and total as an event-driven behavior triggered by quantity changes (PUT/DELETE/POST cart item).","reason":"Story mandates automatic recalculation upon any quantity mutation."},{"section":"Frontend / UI Components","current_state":"Empty cart view exists but lacks explicit 'continue shopping' redirection link.","required_change":"Add requirement for 'continue shopping' link/button in empty cart view, redirecting to product catalog.","reason":"Story specifies this UX pattern for empty cart state."},{"section":"Error Handling","current_state":"Generic error handling exists but lacks cart-specific scenarios (stock unavailability, invalid quantity, session expiry).","required_change":"Document cart-specific error handling: 409 for stock, 400 for invalid quantity, 401 for session expiry, 404 for invalid item.","reason":"Story and implicit requirements demand comprehensive error handling for cart operations."},{"section":"Session Management","current_state":"Session binding strategy unclear; cart may not persist correctly for anonymous vs authenticated users.","required_change":"Explicitly document cart binding to sessionId for anonymous users and userId for authenticated users, including cart migration logic on login.","reason":"Story requires cart to be bound to session or user ID and migrated on authentication."}],"delete":[{"section":"Feature Specifications","description":"Cart sharing, wishlist, or save-for-later features.","reason":"These features are not part of the Shopping Cart Management story scope and represent scope drift."},{"section":"Business Logic","description":"Payment gateway integration or shipping cost calculation in cart context.","reason":"Payment and shipping are separate stories; cart should only handle product price × quantity calculations."},{"section":"Business Logic","description":"Tax calculation or discount/coupon application unless explicitly required by the story.","reason":"These are not specified in the Shopping Cart Management story and should be removed from cart scope."}]}