{"add":[{"section":"Shopping Cart Module","requirement_reference":"story_summary.json: api_contracts_required","description":"Missing explicit API endpoint for GET /api/v1/cart to retrieve cart contents, individual subtotals, and cart total. LLD does not specify the API contract or response structure for this endpoint.","reason":"Story acceptance criteria requires retrieval of cart contents and totals via API, but LLD only describes repository/service logic without API contract details."},{"section":"Shopping Cart Module","requirement_reference":"story_summary.json: business_logic_rules","description":"Missing UI redirection logic for empty cart state ('continue shopping' link). LLD does not specify this behavior in CartService or Cart Model.","reason":"Story acceptance criteria mandates UI redirection for empty cart, but LLD omits this workflow."},{"section":"Shopping Cart Module","requirement_reference":"story_summary.json: api_contracts_required","description":"Missing explicit API endpoint for PUT /api/v1/cart/items/{itemId} to update quantity. LLD describes repository update logic but does not specify API contract or validation rules.","reason":"Story requires API for updating cart item quantity, but LLD omits API specification."},{"section":"Shopping Cart Module","requirement_reference":"story_summary.json: api_contracts_required","description":"Missing explicit API endpoint for DELETE /api/v1/cart/items/{itemId} to remove item from cart. LLD describes repository remove logic but does not specify API contract or response.","reason":"Story requires API for removing cart item, but LLD omits API specification."},{"section":"Shopping Cart Module","requirement_reference":"story_summary.json: data_model_impact","description":"Missing explicit definition of CartItem entity with current Price Snapshot field. LLD CartItem model does not include price snapshot for historical pricing.","reason":"Story requires CartItem to store current price snapshot, but LLD omits this field."}],"modify":[{"section":"Shopping Cart Module","current_state":"CartService.calculateTotals calculates subtotal, tax, shipping, discount, and total, but does not specify automatic recalculation upon quantity mutation.","required_change":"Ensure CartService triggers subtotal and total recalculation automatically whenever item quantity is updated.","reason":"Story requires automatic recalculation of cart totals upon quantity mutation, but LLD does not guarantee this behavior."}],"delete":null}