{"add": [{"section": "Shopping Cart Component (Frontend)", "requirement_reference": "story_summary.json: presentation_layer_needs - 'Empty Cart View with Redirection Link'", "description": "Add explicit UI redirection link in empty cart view to 'continue shopping' as required by story acceptance criteria.", "reason": "LLD describes empty cart UI but does not specify redirection link, which is a required business logic rule."}, {"section": "Shopping Cart Service (Backend)", "requirement_reference": "story_summary.json: business_logic_rules - 'Automatic recalculation of subtotal and total upon any quantity mutation.'", "description": "Add explicit logic for recalculation of subtotal and total in cart service when cart item quantity changes.", "reason": "LLD does not specify recalculation logic for subtotal and total, which is required for business correctness."}, {"section": "Shopping Cart API", "requirement_reference": "story_summary.json: api_contracts_required - 'PUT /api/v1/cart/items/{itemId}'", "description": "Add API endpoint for updating cart item quantity as specified in story summary.", "reason": "LLD lists cart endpoints but does not explicitly document PUT /api/v1/cart/items/{itemId} contract."}], "modify": [{"section": "Cart Item Component (Frontend)", "current_state": "Allows quantity update but does not enforce maximum order quantity from product entity.", "required_change": "Enforce maximum order quantity validation in CartItem component using product.max_order_quantity.", "reason": "Story summary requires quantity validation against max_order_quantity, but LLD frontend logic does not enforce this."}, {"section": "Shopping Cart Service (Backend)", "current_state": "Allows adding items to cart without checking for empty cart state and UI redirection.", "required_change": "Modify backend logic to trigger empty cart state and provide UI redirection information to frontend.", "reason": "Story summary requires empty cart state to trigger UI redirection, but LLD backend logic does not support this."}], "delete": null}