{"add": [{"section": "Shopping Cart Module - Cart Service", "requirement_reference": "story_summary.json: api_contracts_required", "description": "Explicit API endpoint for GET /api/v1/cart to retrieve cart items, individual subtotals, and cart total, as well as UI redirection for empty cart state.", "reason": "The LLD describes cart retrieval and calculation logic but does not explicitly specify the GET /api/v1/cart endpoint contract or the UI redirection for empty cart as required by the story."}, {"section": "Shopping Cart Module - Cart Service", "requirement_reference": "story_summary.json: business_logic_rules", "description": "Automatic recalculation of subtotal and total upon any quantity mutation, and empty cart state must trigger specific UI redirection ('continue shopping' link).", "reason": "The LLD describes subtotal calculation but does not explicitly mention the UI redirection for empty cart or the recalculation trigger on every quantity mutation as required by the story."}], "modify": [{"section": "Shopping Cart Module - Cart Repository and Cart Service", "current_state": "CartService.addItem and updateItem methods validate product availability and update quantities, but do not explicitly enforce the API contract for PUT /api/v1/cart/items/{itemId} and DELETE /api/v1/cart/items/{itemId}.", "required_change": "Update CartService to ensure strict adherence to the API contract for updating and removing cart items, including validation and error handling as described in the story summary.", "reason": "The story summary specifies API contracts and validation/behavioral rules that must be reflected in the LLD logic."}, {"section": "Shopping Cart Module - Cart Model", "current_state": "CartItem contains productId, variantId, quantity, price, and total.", "required_change": "Ensure CartItem includes a current price snapshot at the time of addition, as required by the story summary.", "reason": "The story summary requires CartItem to store the current price snapshot for traceability and accurate recalculation."}], "delete": null}