{"add": [{"section": "Shopping Cart Module - Cart Service", "requirement_reference": "story_summary_json: api_contracts_required: POST /api/v1/cart/items, GET /api/v1/cart, PUT /api/v1/cart/items/{itemId}, DELETE /api/v1/cart/items/{itemId}", "description": "Explicit API contract documentation for all cart-related endpoints, including request/response payloads, error codes, and edge case handling.", "reason": "LLD describes service and repository logic but does not provide explicit API contract documentation as required by the story."}, {"section": "Shopping Cart Module - Cart Service", "requirement_reference": "story_summary_json: business_logic_rules: Empty cart state must trigger specific UI redirection ('continue shopping' link)", "description": "Business logic and API response for empty cart state must include a flag or instruction for frontend to redirect to 'continue shopping' link.", "reason": "LLD does not mention UI redirection or API support for empty cart state as required by the story."}, {"section": "Shopping Cart Module - Cart Service", "requirement_reference": "story_summary_json: CartItem data model: current Price Snapshot", "description": "CartItem entity must store a price snapshot at the time of addition to cart, not just reference to product price.", "reason": "LLD CartItem model does not explicitly mention storing a price snapshot, which is required for accurate order calculation and audit."}], "modify": [{"section": "Shopping Cart Module - Cart Service", "current_state": "CartService.addItem uses current product price when adding to cart, but does not explicitly snapshot price in CartItem.", "required_change": "Modify addItem logic to store the current product price as a snapshot in CartItem at the time of addition.", "reason": "To ensure price consistency and traceability as required by the story's data model impact."}, {"section": "Shopping Cart Module - Cart Service", "current_state": "CartService.calculateTotals applies subtotal, tax, shipping, and discount, but does not mention recalculation on every quantity mutation.", "required_change": "Ensure that subtotal and total are recalculated automatically on every quantity mutation (add, update, remove).", "reason": "Story requires automatic recalculation of subtotal and total upon any quantity mutation."}], "delete": null}