{"add":[{"section":"Shopping Cart Module","requirement_reference":"story_summary.json: api_contracts_required","description":"Missing explicit API endpoint for GET /api/v1/cart to retrieve cart contents, individual subtotals, and cart total. LLD describes repository/service logic but does not specify API contract or response structure.","reason":"Story acceptance criteria requires a RESTful endpoint for cart retrieval, including subtotal and total, which is not reflected in LLD API specification."},{"section":"Shopping Cart Module","requirement_reference":"story_summary.json: business_logic_rules","description":"Missing UI redirection logic for empty cart state ('continue shopping' link). LLD covers backend logic but omits frontend workflow for empty cart scenario.","reason":"Story specifies UI behavior for empty cart, but LLD does not address this requirement."},{"section":"Shopping Cart Module","requirement_reference":"story_summary.json: api_contracts_required","description":"Missing explicit API contract for PUT /api/v1/cart/items/{itemId} to update quantity. LLD describes repository/service update logic but does not specify API endpoint or contract.","reason":"Story requires RESTful endpoint for updating cart item quantity, which is not reflected in LLD API specification."},{"section":"Shopping Cart Module","requirement_reference":"story_summary.json: api_contracts_required","description":"Missing explicit API contract for DELETE /api/v1/cart/items/{itemId} to remove item from cart. LLD describes repository/service remove logic but does not specify API endpoint or contract.","reason":"Story requires RESTful endpoint for removing cart item, which is not reflected in LLD API specification."}],"modify":[{"section":"Shopping Cart Module","current_state":"CartService.addItem validates product availability and adds item to cart, but does not enforce default quantity of 1 when quantity is not specified.","required_change":"Update CartService.addItem to default quantity to 1 if not provided, matching story acceptance criteria.","reason":"Story specifies default quantity of 1 for 'Add to Cart' action, but LLD does not enforce this."},{"section":"Shopping Cart Module","current_state":"CartService.calculateTotals applies pricing, tax, shipping, and discount, but does not explicitly recalculate subtotal and total upon any quantity mutation.","required_change":"Ensure subtotal and total are recalculated immediately after any cart item quantity update.","reason":"Story requires automatic recalculation of subtotal and total upon quantity mutation, but LLD does not guarantee this behavior."}],"delete":null}